export type HolidayRange = {
  name: string;
  start: string;
  end: string;
};

export const holidayRanges: HolidayRange[] = [
  { name: '2025 元旦', start: '2025-01-01', end: '2025-01-01' },
  { name: '2025 春节', start: '2025-01-28', end: '2025-02-04' },
  { name: '2025 清明节', start: '2025-04-04', end: '2025-04-06' },
  { name: '2025 劳动节', start: '2025-05-01', end: '2025-05-05' },
  { name: '2025 端午节', start: '2025-05-31', end: '2025-06-02' },
  { name: '2025 国庆节/中秋节', start: '2025-10-01', end: '2025-10-08' },
  { name: '2026 元旦', start: '2026-01-01', end: '2026-01-03' },
  { name: '2026 春节', start: '2026-02-15', end: '2026-02-23' },
  { name: '2026 清明节', start: '2026-04-04', end: '2026-04-06' },
  { name: '2026 劳动节', start: '2026-05-01', end: '2026-05-05' },
  { name: '2026 端午节', start: '2026-06-19', end: '2026-06-21' },
  { name: '2026 中秋节', start: '2026-09-25', end: '2026-09-27' },
  { name: '2026 国庆节', start: '2026-10-01', end: '2026-10-07' },
];

export const adjustedWorkdays = [
  '2025-01-26',
  '2025-02-08',
  '2025-04-27',
  '2025-09-28',
  '2025-10-11',
  '2026-01-04',
  '2026-02-14',
  '2026-02-28',
  '2026-05-09',
  '2026-09-20',
  '2026-10-10',
];
